<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class ThaiSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \DB::table('thais')->delete();

        \DB::table('thais')->insert([

['arabic_id'=>'1','datasurah_id'=>'1','ayat'=>'1','text'=>'ด้วยพระนามของอัลลอฮฺ ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ','audio'=>'001001.mp3','tafseer'=>' ซูเราะฮฺนี้มีชื่อว่า อัลฟาติหะฮฺ(ผู้เปิด) หมายถึงผู้เปิดคัมภีร์(อัลกุรอาน)ที่ได้มีการเขียนบันทึกขึ้น และซูเราะฮฺอัลฟาติหะฮฺนี้เป็นคำเปิดอ่านในละหมาด มีบางคนเรียกว่า อุมมุลกิตาบ=>أم الكتاب (แม่ของคัมภีร์อัลกุรอาน) แต่อะนัซ อัลหะซันและอิบนุซีรีน ไม่เห็นด้วยกับการเรียกชื่อซูเราะฮฺนี้ว่า อุมมุลกิตาม เพราะอัลหะซันและอิบนุซีรีน มีความเห็นว่า ชื่อ อุมมุลกิตาบนี้เป็นชื่อของ เลาฮุลมะหิชฺฟูซ(اللوح المحفوظ)[1] อัลหะซันกล่าวว่า อายาตุลมุหฺกะมาต(โองการที่มีข้อความรัดกุมชัดเจน) คือ อุมมุลกิตาบ(แม่ของคัมภีร์) ดังนั้นทั้งสองคนจึงไม่เห็นด้วยที่จะให้ชื่อซูเราะฮฺอัลฟาติหะฮฺว่า อุมมุลกุรอาน(แม่ของอัลกุรอาน)เช่นกัน'],
['arabic_id'=>'2','datasurah_id'=>'1','ayat'=>'2','text'=>'การสรรเสริญทั้งหลายนั้น เป็นสิทธิของอัลลอฮฺผู้เป็นพระเจ้าแห่งสากลโลก','audio'=>'001002.mp3','tafseer'=>'อะบูฮุร็อบเราะฮฺ, มุญาฮิด, อะฏออฺ อิบนุ ยะซารฺและอัซซัฮฺรีย์ กล่าวว่า ซูเราะฮฺนี้เป็นซูเราะฮฺมะดะนียะฮฺ(مَدَنِيَّة) หมายถึงเป็นซูเราะฮฺที่ประทานลงในระหว่างที่นบีอยู่มะดีนะฮฺ แต่ก็มีอีกความเห็นกล่าวว่าซูเราะฮฺนี้ประทานลงมา 2 ครั้ง ครั้งหนึ่งที่มักกะฮฺและอีกครั้งที่มะดีนะฮฺ'],
['arabic_id'=>'3','datasurah_id'=>'1','ayat'=>'3','text'=>'ผู้ทรงกรุณาปราณี ผู้ทรงเมตตาเสมอ','audio'=>'001003.mp3','tafseer'=>'ความประเสริฐของการอ่าน ซูเราะฮฺ อัลฟาติหะฮฺ ในฮะดีษกุรซีย์ ระบุว่าเป็นการสนทนาระหว่างบ่าวกับอัลลอฮฺ­ตะอาลา โดยมีรายงานจากท่านอะบีฮุรอยเราะฮฺ ร่อฎิยันลอฮุอันฮากล่าวว่า “ฉันได้ยินร่อซูลลุลลอฮฺ ซล. กล่าวว่า อัลลอฮฺตะอาลา ตรัสว่า” ข้าได้แบ่งการละหมาด ออกเป็นสองส่วนระหว่างข้ากับบ่าวของข้า สำหรับบ่าวของข้านั้นเขาจะได้ตามสิ่งที่เข­าขอ'],
['arabic_id'=>'4','datasurah_id'=>'1','ayat'=>'4','text'=>'ผู้ทรงอภิสิทธิ์แห่งวันตอบแทน','audio'=>'001004.mp3','tafseer'=>'เมื่อบ่าวกล่าวว่า(อัลฮัมดุลิ้ลลาฮิ ร็อบบิล อาละมีน) อัลลอฮฺตะอาลาก็ตรัสว่า บ่าวของข้าได้สรรเสริญข้า และเมื่อเขากล่าวว่า (อัรเราะฮฺมานิรเราะฮีม) อัลลอฮฺตะอาลาก็ตรัสว่า บ่าวของข้าชมเชยข้า'],
['arabic_id'=>'5','datasurah_id'=>'1','ayat'=>'5','text'=>'เฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์เคารพอิบาดะฮฺ และเฉพาะพระองค์เท่านั้นที่พวกข้าพระองค์ขอความช่วยเหลือ','audio'=>'001005.mp3','tafseer'=>'และเมื่อเขากล่าวว่า (มาลิกิเยามิดดีน)พระองค์ก็ตรัสว่า บ่าวของข้าเทิดเกียรติข้า และตรัสอีกครั้งหนึ่งว่า บ่าวของข้าได้มอบหมายแก่ข้า และเมื่อเขากล่าวว่า (อี้ยากะ นะอฺบุดุ วะอี้ยากะนัสตะอีน) '],
['arabic_id'=>'6','datasurah_id'=>'1','ayat'=>'6','text'=>'ขอพระองค์ทรงแนะนำพวกข้าพระองค์ซึ่งทางอันเที่ยงตรง','audio'=>'001006.mp3','tafseer'=>' พระองค์ก็ตรัสว่าเรื่องนี้ระหว่างข้ากับบ่­าวของข้า และสำหรับบ่าวของข้าจะได้สิ่งที่เขาขอ'],
['arabic_id'=>'7','datasurah_id'=>'1','ayat'=>'7','text'=>'(คือ) ทางของบรรดาผู้ที่พระองค์ได้ทรงโปรดปราณแก่พวกเขา มิใช่ในทางของพวกที่ถูกกริ้ว และมิใช่ทางของพวกที่หลงผิด','audio'=>'001007.mp3','tafseer'=>'เมื่อเขากล่าวว่า (อิฮฺดินัศศิรอ ฏ้อลมุสตะกีม ศิรอฏ็อล ละซีนะ อันอัมตะ อะลัยฮิม ฆ็อยริล มัฆฎู บิอะลัยฮิม วะลัฎฎอลลีน) พระองค์ก็ตรัสว่า สิ่งนี้จะได้แก่บ่าวของข้าและบ่าวของข้าจะ­ได้สิ่งที่เขาขอ']
        ]);   
    }
}
